TODO.org
#+OPTIONS: ^:nil

* Critères

** DONE Rendu sur GitHub et déploiement sur Netlify

** DONE useReducer avec des actions FETCH_INIT, FETCH_SUCCESS, FETCH_FAILURE

- [X] FETCH_INIT
- [X] FETCH_SUCCESS
- [X] FETCH_FAILURE

** DONE GradientsContext est mis en place correctement

** DONE la structure des routes est respectée et fonctionne correctement

** DONE la navigation (Accueil, Précédent, Suivant) depuis routes /gradient/:id fonctionne correctement

** DONE le bouton “Plein écran” fonctionne

** DONE les gradients viennent depuis l’API

** TODO il n’y a pas de warning depuis la console dans VSCode, ni dans la console du navigateur

* Bonus

** TODO Ajoute gradient et stocke dans localstorage

** TODO API Heroku perso

