TODO.md

# Table of Contents

1.  [Critères](#orga9e1701)
    1.  [Rendu sur GitHub et déploiement sur Netlify](#org33e6800)
    2.  [useReducer avec des actions FETCH\_INIT, FETCH\_SUCCESS, FETCH\_FAILURE](#org4abbac2)
    3.  [GradientsContext est mis en place correctement](#org8dc1988)
    4.  [la structure des routes est respectée et fonctionne correctement](#org4383b3e)
    5.  [la navigation (Accueil, Précédent, Suivant) depuis routes *gradient*:id fonctionne correctement](#orga630b76)
    6.  [le bouton “Plein écran” fonctionne](#orgf7505e5)
    7.  [les gradients viennent depuis l’API](#org69f739f)
    8.  [il n’y a pas de warning depuis la console dans VSCode, ni dans la console du navigateur](#orgbbcc900)
2.  [Bonus](#org18d3916)
    1.  [Ajoute gradient et stocke dans localstorage](#org5654bd0)
    2.  [API Heroku perso](#org5a96b49)



<a id="orga9e1701"></a>

# Critères


<a id="org33e6800"></a>

## DONE Rendu sur GitHub et déploiement sur Netlify


<a id="org4abbac2"></a>

## DONE useReducer avec des actions FETCH\_INIT, FETCH\_SUCCESS, FETCH\_FAILURE

-   [X] FETCH\_INIT
-   [X] FETCH\_SUCCESS
-   [X] FETCH\_FAILURE


<a id="org8dc1988"></a>

## DONE GradientsContext est mis en place correctement


<a id="org4383b3e"></a>

## DONE la structure des routes est respectée et fonctionne correctement


<a id="orga630b76"></a>

## DONE la navigation (Accueil, Précédent, Suivant) depuis routes *gradient*:id fonctionne correctement


<a id="orgf7505e5"></a>

## DONE le bouton “Plein écran” fonctionne


<a id="org69f739f"></a>

## DONE les gradients viennent depuis l’API


<a id="orgbbcc900"></a>

## TODO il n’y a pas de warning depuis la console dans VSCode, ni dans la console du navigateur


<a id="org18d3916"></a>

# Bonus


<a id="org5654bd0"></a>

## TODO Ajoute gradient et stocke dans localstorage


<a id="org5a96b49"></a>

## TODO API Heroku perso

